export const LOCATION_DATA = {
  "서울": {
    "강남구": ["역삼동","개포동","논현동","대치동","도곡동","삼성동","세곡동","수서동","신사동","압구정동","율현동","일원동","자곡동","청담동"],
    "강동구": ["강일동","고덕동","길동","둔촌동","명일동","상일동","성내동","암사동","천호동"],
    "강북구": ["미아동","번동","수유동","우이동"],
    "강서구": ["가양동","개화동","공항동","과해동","내발산동","등촌동","마곡동","방화동","염창동","오곡동","오쇠동","외발산동","화곡동"],
    "관악구": ["남현동","봉천동","신림동"],
    "광진구": ["광장동","구의동","군자동","능동","자양동","중곡동","화양동"],
    "구로구": ["가리봉동","개봉동","고척동","구로동","궁동","신도림동","오류동","온수동","천왕동","항동"],
    "금천구": ["가산동","독산동","시흥동"],
    "노원구": ["공릉동","상계동","월계동","중계동","하계동"],
    "도봉구": ["도봉동","방학동","쌍문동","창동"],
    "동대문구": ["답십리동","신설동","용두동","이문동","장안동","전농동","제기동","회기동","휘경동"],
    "동작구": ["노량진동","대방동","동작동","본동","사당동","상도동","신대방동","흑석동"],
    "마포구": ["공덕동","구수동","노고산동","당인동","대흥동","도화동","마포동","망원동","상암동","서교동","성산동","신공덕동","신수동","신정동","아현동","연남동","염리동","용강동","중동","창전동","토정동","하중동","합정동","현석동"],
    "서대문구": ["남가좌동","냉천동","대신동","대현동","미근동","봉원동","북가좌동","북아현동","신촌동","연희동","영천동","옥천동","창천동","천연동","충정로","합동","현저동","홍은동","홍제동"],
    "서초구": ["내곡동","반포동","방배동","서초동","신원동","양재동","염곡동","우면동","원지동","잠원동"],
    "성동구": ["금호동","도선동","마장동","사근동","상왕십리동","성수동","송정동","옥수동","용답동","응봉동","하왕십리동","행당동","홍익동"],
    "성북구": ["길음동","돈암동","동소문동","동선동","보문동","삼선동","상월곡동","석관동","성북동","안암동","장위동","정릉동","종암동","하월곡동"],
    "송파구": ["가락동","거여동","마천동","문정동","방이동","삼전동","석촌동","송파동","오금동","잠실동","장지동","풍납동"],
    "양천구": ["목동","신월동","신정동"],
    "영등포구": ["당산동","대림동","도림동","문래동","신길동","양평동","양화동","여의도동","영등포동"],
    "용산구": ["갈월동","남영동","도원동","동빙고동","동자동","문배동","보광동","산천동","서계동","서빙고동","신계동","신창동","용문동","용산동","원효로","이촌동","이태원동","주성동","청암동","청파동","한강로","한남동","효창동","후암동"],
    "은평구": ["갈현동","구산동","녹번동","대조동","불광동","수색동","신사동","역촌동","응암동","증산동","진관동"],
    "종로구": ["가회동","견지동","경운동","계동","공평동","관수동","관철동","관훈동","교남동","교북동","구기동","궁정동","권농동","낙원동","내수동","내자동","누상동","누하동","당주동","도렴동","돈의동","동숭동","명륜동","묘동","무악동","봉익동","부암동","사간동","사직동","삼청동","서린동","세종로","소격동","송월동","송현동","수송동","숭인동","신교동","신문로","신영동","안국동","연건동","연지동","예지동","옥인동","와룡동","운니동","원남동","원서동","이화동","익선동","인사동","인의동","장사동","재동","적선동","종로1가","종로2가","종로3가","종로4가","종로5가","종로6가","중학동","창신동","청운동","청진동","체부동","충신동","통의동","통인동","팔판동","평동","평창동","필운동","행촌동","혜화동","홍지동","홍파동","화동","효자동","효제동","훈정동"],
    "중구": ["광희동","남대문로","남산동","남학동","다동","만리동","명동","무교동","무학동","방산동","봉래동","북창동","산림동","삼각동","서소문동","소공동","수표동","수하동","순화동","신당동","쌍림동","예관동","예장동","오장동","을지로","의주로","인현동","입정동","장교동","장충동","저동","정동","주교동","주자동","중림동","초동","충무로","충정로","태평로","필동","황학동","회현동","흥인동"],
    "중랑구": ["망우동","면목동","묵동","상봉동","신내동","중화동"]
  },
  "광주": {
    "동구": ["계림동","광산동","남동","내남동","대인동","대장동","동명동","산수동","서석동","소태동","수기동","용산동","운림동","월남동","장동","지산동","학동","호남동","황금동"],
    "서구": ["광천동","금호동","내방동","농성동","덕흥동","마륵동","매월동","벽진동","상무동","세하동","쌍촌동","양동","유촌동","치평동","풍암동","화정동"],
    "남구": ["구소동","구이동","노대동","대지동","덕남동","도금동","방림동","백운동","봉선동","사동","서동","석정동","송하동","승촌동","신복동","압촌동","양과동","양림동","양촌동","어룡동","월산동","월성동","이장동","임암동","제석동","주월동","지석동","칠석동","행암동","화장동"],
    "북구": ["각화동","금곡동","누문동","대촌동","덕의동","망월동","매곡동","문흥동","본촌동","북동","삼각동","생용동","수곡동","신안동","신용동","양산동","연제동","오룡동","오치동","용두동","용봉동","용전동","우산동","운암동","운정동","월출동","유동","일곡동","임동","장등동","중흥동","지야동","청풍동","충효동","풍향동","화암동","효령동"],
    "광산구": ["고룡동","광산동","남산동","내산동","대산동","덕림동","도덕동","도천동","도호동","동림동","동산동","동호동","명도동","명화동","박호동","복룡동","본덕동","비아동","사호동","산막동","산월동","산정동","삼거동","삼도동","서봉동","선동","선암동","소촌동","송대동","송산동","송정동","송촌동","송치동","송학동","수완동","신가동","신동","신창동","신촌동","쌍암동","안청동","양동","양산동","어룡동","연산동","오선동","오운동","옥동","왕동","요기동","용곡동","용동","용봉동","우산동","운남동","운수동","월계동","월곡동","월전동","유계동","임곡동","장덕동","장록동","장수동","지죽동","지평동","진곡동","하남동","하산동","황룡동","흑석동"]
  },
  "부산": {
    "해운대구": ["우동","중동","좌동","송정동","반여동","반송동","재송동"],
    "수영구": ["망미동","수영동","민락동","광안동","남천동"],
    "진구": ["가야동","개금동","당감동","범전동","범천동","부암동","부전동","양정동","연지동","전포동","초읍동"]
  },
  "인천": {
    "연수구": ["송도동","옥련동","선학동","연수동","청학동","동춘동"],
    "중구": ["신포동","연안동","신흥동","도원동","율목동","동인천동","북성동","송월동","영종동","운서동","용유동"]
  },
  "대구": {
    "중구": [],
    "동구": [],
    "서구": [],
    "남구": [],
    "북구": [],
    "수성구": [],
    "달서구": [],
    "달성군": []
  },
  "대전": {
    "동구": [],
    "중구": [],
    "서구": [],
    "유성구": [],
    "대덕구": []
  },
  "울산": {
    "중구": [],
    "남구": [],
    "동구": [],
    "북구": [],
    "울주군": []
  },
  "경기": {
    "수원시": ["장안구","권선구","팔달구","영통구"],
    "성남시": ["수정구","중원구","분당구"],
    "안양시": ["만안구","동안구"],
    "부천시": ["부천동","심곡동","상동","중동","신중동"],
    "안산시": ["상록구","단원구"],
    "고양시": ["덕양구","일산동구","일산서구"],
    "용인시": ["처인구","기흥구","수지구"]
  },
  "강원": {
    "춘천시": [],
    "원주시": [],
    "강릉시": []
  },
  "충북": {
    "청주시": ["상당구","서원구","흥덕구","청원구"],
    "충주시": [],
    "제천시": []
  },
  "충남": {
    "천안시": ["동남구","서북구"],
    "공주시": [],
    "아산시": []
  },
  "전북": {
    "전주시": ["완산구","덕진구"],
    "군산시": [],
    "익산시": []
  },
  "전남": {
    "목포시": [],
    "여수시": [],
    "순천시": []
  },
  "경북": {
    "포항시": ["남구","북구"],
    "경주시": [],
    "안동시": []
  },
  "경남": {
    "창원시": ["의창구","성산구","마산합포구","마산회원구","진해구"],
    "진주시": [],
    "김해시": []
  },
  "세종": {
    "세종시": ["고운동","금남면","나성동","다정동","대평동","도담동","반곡동","보람동","부강면","소담동","소정면","아름동","어진동","연기면","연동면","연서면","장군면","전의면","전동면","조치원읍","종촌동","한솔동"]
  },
  "제주": {
    "제주시": ["건입동","내도동","노형동","도두동","도련동","도평동","봉개동","삼도동","삼양동","아라동","연동","오등동","외도동","용담동","이도동","이호동","일도동","화북동","회천동","애월읍","한림읍","조천읍","구좌읍","한경면","추자면","우도면"],
    "서귀포시": ["강정동","대포동","도순동","동홍동","법환동","보목동","상예동","상효동","색달동","서귀동","서호동","서홍동","영남동","월평동","하예동","하효동","호근동","회수동","대정읍","남원읍","성산읍","안덕면","표선면"]
  }
}
